src/Catalogs/ПроверкаАПК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПроверкаАПК</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Хранилища</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеКонфигурацииВАПК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаСоединения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АПКПользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АПКПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВРегламентномЗадании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/СписокИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СписокИзменений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииКонфигурацийХранилища</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Хранилища</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ПроверкаАПК/Ext/ManagerModule.bsl
Функция Параметры( Знач пСсылка ) Экспорт

	структ = Новый Структура;
	
	структ.Вставить( "НаименованиеКонфигурацииВАПК", пСсылка.НаименованиеКонфигурацииВАПК );
	структ.Вставить( "СтрокаСоединения", пСсылка.СтрокаСоединения );
	структ.Вставить( "Пользователь", пСсылка.АПКПользователь );
	структ.Вставить( "Пароль", пСсылка.АПКПароль );
	
	структ.Вставить( "Приложение1С", пСсылка.Владелец.Приложение1С );
	структ.Вставить( "Владелец", пСсылка.Владелец );
	
	Возврат структ;

КонецФункции // Параметры()

Процедура ВыполнитьПроверку(Знач пПроверкаАПК ) Экспорт

	структПараметры = Параметры( пПроверкаАПК );
	
	Хранилище = структПараметры.Владелец;
	
	об = Хранилище.ПолучитьОбъект();
	об.ВыполняетсяПроверкаАПК = Истина;
	об.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СписокИзменений.Объект КАК ПутьОбъекта,
	               |	СписокИзменений.ТипОбъекта КАК ТипОбъекта,
	               |	СписокИзменений.Версия.Пользователь.ИмяПользователя КАК Ответственный,
	               |	СписокИзменений.Версия.Пользователь.Email КАК АдресЭлектроннойПочты
	               |ИЗ
	               |	РегистрСведений.СписокИзменений КАК СписокИзменений
	               |ГДЕ
	               |	СписокИзменений.Хранилище = &Хранилище
	               |	И НЕ СписокИзменений.Объект = """"";  
	Запрос.УстановитьПараметр("Хранилище", Хранилище );
	
	тз = Запрос.Выполнить().Выгрузить();
	
	имяФайлаОтветственных = ПолучитьИмяВременногоФайла();
	
	ЗначениеВФайл( имяФайлаОтветственных, тз );
	
	стрПараметрЗапуска = "/CЗапускПроверки_" + "КОНФ=" + структПараметры.НаименованиеКонфигурацииВАПК;
	стрПараметрЗапуска = стрПараметрЗапуска + ";";
	стрПараметрЗапуска = стрПараметрЗапуска + "Ответственные=" + имяФайлаОтветственных;
	
	
	ПакетныйРежим.ОбновитьКонфигурациюБазыДанных( Хранилище,
											Хранилище.Приложение1С,
											Хранилище.ТранзитнаяБазаАдрес,
											Хранилище.ТранзитнаяБазаПользователь,
											Хранилище.ТранзитнаяБазаПароль );
	ПакетныйРежим.ЗапуститьВРежимеПредприятияПоСтрокеСоединения( структПараметры.Приложение1С,
																	структПараметры.СтрокаСоединения,
																	структПараметры.Пользователь,
																	структПараметры.Пароль,
																	Истина,
																	стрПараметрЗапуска);
	
	об = Хранилище.ПолучитьОбъект();
	об.ВыполняетсяПроверкаАПК = Ложь;
	об.Записать();
	
	УдалитьФайлы( имяФайлаОтветственных );
	
КонецПроцедуры
